In [1]:
import pandas as pd

# DataFrame
data = {
    'Name': ['Alice', 'Bob', 'Charlie', 'David'],
    'Age': [25, 30, 35, 40],
    'City': ['New York', 'San Francisco', 'Los Angeles', 'Chicago'],
    'Salary': [70000, 80000, 120000, 90000],
    'Date': ['2023-01-01', '2023-02-15', '2023-03-10', '2023-04-20']
}
df = pd.DataFrame(data)

In [2]:
df['Date'] = pd.to_datetime(df['Date'])

In [3]:
df[df['Age'] > 30]

      Name  Age         City  Salary       Date
2  Charlie   35  Los Angeles  120000 2023-03-10
3    David   40      Chicago   90000 2023-04-20